#Напишите программу, которая выдает строку, получаемую путём повторения N раз. Данные N и текстовая цепочка символов
#вводятся на разных строках. Вспоминаем про умножение строки на целое число.

a = int(input())
b = input()
print(b * a)