#Напишите программу, которая считает среднее арифметическое трёх целых чисел. Числа заданы на разных строках.

a = int(input())
b = int(input())
c = int(input())
print((a + b + c)/3)