#Напишите программу, которая считает сумму трёх целых чисел. Данные находятся на разных строках.

a = int(input())
b = int(input())
c = int(input())
print(a + b + c)