#Напишите программу, которая считает произведение двух вещественных чисел. Данные находятся на разных строках.

a = float(input())
b = float(input())
print(a * b)