#Напишите программу, которая считает квадрат введённого вещественного числа.
#В PyCharm выбивает ошибку, но на Stepik работает

a = float(input())
print(a**2)