#Напишите программу, вычисляющую остаток от целочисленного деления введённого целого числа на 5.

a = int(input())
print(a % 5)