#Напишите программу, вычисляющую квадратный корень введённого целого числа. Задаваемое число больше или равно 0.

a = int(input())
print(a ** 0.5)