#Новое задание. Напишите программу, которая выводит на экран удвоенное значение введённого целого числа.
#Напомним, что функция input() считывает данные как ТЕКСТ!
#Перед процедурой сдачи кода своих программ проверяйте их на одном из онлайн Python-ресурсов. Удачи!

a = int(input())
print(a*2)