#Напишите программу, которая считает квадрат введённого вещественного числа.

a = float(input())
print(a**2)